app/views/recipes/_recipe_ingredients.html.erb

  <div class="field">
    <%= f.select :ingredient_id, Ingredient.order(:description).collect {|s|
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."order" = 'description'