app/views/recipes/show.html.erb

SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]
---
  </tr>
   <% @recipe.recipe_ingredients.each do |ff| %>