app/views/ingredients/_form.html.erb

      <%= f.label "Unidade de Medida" %><br>
      <%= f.collection_select :measurement_unit_id, MeasurementUnit.order(:Unit),:id,:Unit, include_blank: true %>
---
SELECT "measurement_units".* FROM "measurement_units" ORDER BY "measurement_units"."Unit" ASC