app/views/ingredients/index.html.erb

        <td><%= ingredient.description %></td>
        <td><%= MeasurementUnit.find_by_id(ingredient.measurement_unit_id).Unit %></td>
---
SELECT "measurement_units".* FROM "measurement_units" WHERE "measurement_units"."id" = ? LIMIT 1  [["id", "1"]]