app/controllers/ingredients_controller.rb

  def index
    @ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

  def create
    @ingredient = Ingredient.new(ingredient_params)
    #@ingredient = @measurement_unit.ingredients.build(params[:ingredient]) - versão anterior
    #@ingredient = @measurement_unit.ingredients.build(ingredient_params)
    respond_to do |format|
      if @ingredient.save
---
INSERT INTO "ingredients" ("created_at", "description", "measurment_unit_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 02 Apr 2015 16:42:51 UTC +00:00], ["description", "Morango"], ["measurment_unit_id", 0], ["updated_at", Thu, 02 Apr 2015 16:42:51 UTC +00:00]]

  def update
     #@ingredient = @measurement_unit.ingredients.find(params[:id])
    respond_to do |format|
      if @ingredient.update(ingredient_params)
---
UPDATE "ingredients" SET "measurement_unit_id" = ?, "description" = ?, "updated_at" = ? WHERE "ingredients"."id" = 1  [["measurement_unit_id", 4], ["description", "espinafres"], ["updated_at", Tue, 07 Apr 2015 23:15:11 UTC +00:00]]

  def destroy
    #@ingredient = @measurement_unit.ingredients.find(params[:id])
    @ingredient.destroy
---
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 1]]

    def set_ingredient
      @ingredient = Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "3"]]