app/controllers/measurement_units_controller.rb

SELECT "measurement_units".* FROM "measurement_units"
---
  def index
    #@measurement_units = @ingredient.MeasurementUnit
    @measurement_units = MeasurementUnit.all

INSERT INTO "measurement_units" ("Symbol", "Unit", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Symbol", "gr"], ["Unit", "Grama"], ["created_at", Thu, 02 Apr 2015 08:27:10 UTC +00:00], ["updated_at", Thu, 02 Apr 2015 08:27:10 UTC +00:00]]
---
  def create
    @measurement_unit = MeasurementUnit.new(measurement_unit_params)

    respond_to do |format|
      if @measurement_unit.save

SELECT "measurement_units".* FROM "measurement_units" WHERE "measurement_units"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_measurement_unit
      @measurement_unit = MeasurementUnit.find(params[:id])