app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("created_at", "procedure", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 13 Apr 2015 11:06:23 UTC +00:00], ["procedure", ""], ["title", "Bife com batatas fritas"], ["updated_at", Mon, 13 Apr 2015 11:06:23 UTC +00:00]]
---
  def create
    @recipe = Recipe.new(recipe_params)


    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "serves" = ?, "updated_at" = ? WHERE "recipes"."id" = 17  [["serves", #<BigDecimal:7f6c68399de8,'0.2E1',9(18)>], ["updated_at", Wed, 15 Apr 2015 16:46:06 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)